#include <stdio.h>



int main() {
    
    int num = 0;
    printf("Введіть ціле число: ");
    scanf("%d", &num);  // Зчитуємо ціле число і записуємо його в змінну number
   
    char symbol = 'A';
    char* str = "Hello, World!";
    void* ptr = &num;

    // Виведення цілого числа у різних форматах
    printf("Ціле число у десятковому форматі: %d\n", num);
    printf("Ціле число у двійквому   форматі :%b\n", num);
    printf("Ціле число у вісімковому форматі: %o\n", num);
    printf("Ціле число у шістнадцятковому форматі: %x\n", num);

    // Виведення дійсного числа у різних форматах
    float realNum;     
    printf("Введіть число з плаваючою комою: ");    
    scanf("%f", &realNum);  //Зчитуємо значення типу float
    printf("Дійсне число у звичайному форматі: %f\n", realNum);// Виводимо змінну типу float
    printf("Дійсне число у експоненційному форматі: %e\n", realNum);
    printf("Дійсне число у гнучкому форматі: %g\n", realNum);

    // Виведення символа, стрічки та вказівника
    printf("Символ: %c\n", symbol);
    printf("Рядок: %s\n", str);
    printf("Вказівник: %p\n", ptr);

    return 0;
}
